/*------------------------------------------------------------------------------
-- 개체 이름: HYUNS00.BBS_CATE_NO
-- 만든 날짜: 2017-04-06 오후 9:45:09
-- 마지막으로 수정한 날짜: 2017-04-06 오후 9:45:09
-- 상태: VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE HYUNS00.BBS_CATE_NO
    START WITH 82
    INCREMENT BY 1
    MAXVALUE 9999999999999999999999999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;
/*------------------------------------------------------------------------------
-- 개체 이름: HYUNS00.BBS_COMMENT_NO
-- 만든 날짜: 2017-03-22 오후 11:56:36
-- 마지막으로 수정한 날짜: 2017-03-22 오후 11:56:36
-- 상태: VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE HYUNS00.BBS_COMMENT_NO
    START WITH 21
    INCREMENT BY 1
    MAXVALUE 9999999999999999999999999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;
/*------------------------------------------------------------------------------
-- 개체 이름: HYUNS00.BBS_COMMENT_SUB_NO
-- 만든 날짜: 2017-03-22 오후 11:56:46
-- 마지막으로 수정한 날짜: 2017-03-22 오후 11:56:46
-- 상태: VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE HYUNS00.BBS_COMMENT_SUB_NO
    START WITH 21
    INCREMENT BY 1
    MAXVALUE 9999999999999999999999999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;
/*------------------------------------------------------------------------------
-- 개체 이름: HYUNS00.BBS_FILE_NO
-- 만든 날짜: 2017-03-22 오후 11:57:04
-- 마지막으로 수정한 날짜: 2017-03-22 오후 11:57:04
-- 상태: VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE HYUNS00.BBS_FILE_NO
    START WITH 1
    INCREMENT BY 1
    MAXVALUE 9999999999999999999999999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;
/*------------------------------------------------------------------------------
-- 개체 이름: HYUNS00.BBS_MENU_NO
-- 만든 날짜: 2017-05-20 오전 11:36:16
-- 마지막으로 수정한 날짜: 2017-05-20 오전 11:36:16
-- 상태: VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE HYUNS00.BBS_MENU_NO
    START WITH 1
    INCREMENT BY 1
    MAXVALUE 9999999999999999999999999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;
/*------------------------------------------------------------------------------
-- 개체 이름: HYUNS00.BBS_MESSAGE_NO
-- 만든 날짜: 2017-04-11 오후 9:44:43
-- 마지막으로 수정한 날짜: 2017-04-11 오후 9:44:43
-- 상태: VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE HYUNS00.BBS_MESSAGE_NO
    START WITH 1
    INCREMENT BY 1
    MAXVALUE 9999999999999999999999999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;
/*------------------------------------------------------------------------------
-- 개체 이름: HYUNS00.BBS_NO
-- 만든 날짜: 2017-03-22 오후 11:57:20
-- 마지막으로 수정한 날짜: 2017-03-22 오후 11:57:20
-- 상태: VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE HYUNS00.BBS_NO
    START WITH 41
    INCREMENT BY 1
    MAXVALUE 9999999999999999999999999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;
/*------------------------------------------------------------------------------
-- 개체 이름: HYUNS00.BBS_SCRAP_NO
-- 만든 날짜: 2017-04-11 오후 9:50:50
-- 마지막으로 수정한 날짜: 2017-04-11 오후 9:50:50
-- 상태: VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE HYUNS00.BBS_SCRAP_NO
    START WITH 1
    INCREMENT BY 1
    MAXVALUE 9999999999999999999999999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;
/*------------------------------------------------------------------------------
-- 개체 이름: HYUNS00.BBS_SUB_NO
-- 만든 날짜: 2017-03-22 오후 11:57:33
-- 마지막으로 수정한 날짜: 2017-03-22 오후 11:57:33
-- 상태: VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE HYUNS00.BBS_SUB_NO
    START WITH 21
    INCREMENT BY 1
    MAXVALUE 9999999999999999999999999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;
/*------------------------------------------------------------------------------
-- 개체 이름: HYUNS00.LOGIN_NO
-- 만든 날짜: 2017-03-22 오후 11:57:43
-- 마지막으로 수정한 날짜: 2017-03-22 오후 11:57:43
-- 상태: VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE HYUNS00.LOGIN_NO
    START WITH 21
    INCREMENT BY 1
    MAXVALUE 9999999999999999999999999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;