/*------------------------------------------------------------------------------
-- 개체 이름 : HYUNS00.BBS_COMMENT_NO
-- 만든 날짜 : 2016-07-20 오전 9:13:42
-- 마지막으로 수정한 날짜 : 2016-07-20 오전 9:13:42
-- 상태 : VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE HYUNS00.BBS_COMMENT_NO
    START WITH 61
    INCREMENT BY 1
    MAXVALUE 9999999999999999999999999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;


/*------------------------------------------------------------------------------
-- 개체 이름 : HYUNS00.BBS_COMMENT_SUB_NO
-- 만든 날짜 : 2016-07-20 오전 9:21:36
-- 마지막으로 수정한 날짜 : 2016-07-20 오전 9:21:36
-- 상태 : VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE HYUNS00.BBS_COMMENT_SUB_NO
    START WITH 61
    INCREMENT BY 1
    MAXVALUE 9999999999999999999999999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;


/*------------------------------------------------------------------------------
-- 개체 이름 : HYUNS00.BBS_FILE_NO
-- 만든 날짜 : 2016-07-20 오전 9:14:07
-- 마지막으로 수정한 날짜 : 2016-07-20 오전 9:14:07
-- 상태 : VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE HYUNS00.BBS_FILE_NO
    START WITH 21
    INCREMENT BY 1
    MAXVALUE 9999999999999999999999999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;


/*------------------------------------------------------------------------------
-- 개체 이름 : HYUNS00.BBS_NO
-- 만든 날짜 : 2016-07-20 오전 9:14:24
-- 마지막으로 수정한 날짜 : 2016-07-20 오전 9:14:24
-- 상태 : VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE HYUNS00.BBS_NO
    START WITH 21
    INCREMENT BY 1
    MAXVALUE 9999999999999999999999999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;


/*------------------------------------------------------------------------------
-- 개체 이름 : HYUNS00.BBS_SUB_NO
-- 만든 날짜 : 2016-07-20 오전 9:21:12
-- 마지막으로 수정한 날짜 : 2016-07-20 오전 9:21:12
-- 상태 : VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE HYUNS00.BBS_SUB_NO
    START WITH 21
    INCREMENT BY 1
    MAXVALUE 9999999999999999999999999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;


/*------------------------------------------------------------------------------
-- 개체 이름 : HYUNS00.LOGIN_FILE_NO
-- 만든 날짜 : 2016-07-19 오후 3:24:58
-- 마지막으로 수정한 날짜 : 2016-07-19 오후 3:24:58
-- 상태 : VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE HYUNS00.LOGIN_FILE_NO
    START WITH 1
    INCREMENT BY 1
    MAXVALUE 9999999999999999999999999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;


/*------------------------------------------------------------------------------
-- 개체 이름 : HYUNS00.LOGIN_NO
-- 만든 날짜 : 2016-07-18 오후 2:03:34
-- 마지막으로 수정한 날짜 : 2016-07-18 오후 2:03:34
-- 상태 : VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE HYUNS00.LOGIN_NO
    START WITH 1
    INCREMENT BY 1
    MAXVALUE 9999999999999999999999999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;

