// ***********************************************************************************************************  
// 문자열에 공백이 있는지 검사
// ***********************************************************************************************************  
function checkEmpty(strText) {
	try {
		if (strText.match(/^[ ]*$/)) {
			return true;
		} else {
			return false;
		}
	}
	catch (ex) {
		alert(ex.description);
	}
}

// ***********************************************************************************************************
// 문자열이 숫자만 존재하는지 검사
// ***********************************************************************************************************
function checkNumber(strText) {
	try {
		if (strText.match(/^[-]{0,1}[0-9.]+$/)) {
			return true;
		} else {
			return false;
		}
	}
	catch (ex) {
		alert(ex.description);
	}
}

// ***********************************************************************************************************
// 문자열에 영문이 한자라도 있는지 검사
// ***********************************************************************************************************
function checkEnglish(strText) {
	try {
		if (strText.match(/[a-zA-Z]+/)) {
			return true;
		} else {
			return false;
		}
	}
	catch (ex) {
		alert(ex.description);
	}
}

// ***********************************************************************************************************
// 문자열에 한글이 한자라도 있는지 검사
// ***********************************************************************************************************
function checkHangul(strText) {
	try {
		if (strText.match(/[ㄱ-ㅎ|ㅏ-ㅣ|가-힣]+/)) {
			return true;
		} else {
			return false;
		}
	}
	catch (ex) {
		alert(ex.description);
	}
}

// ***********************************************************************************************************
// 이메일이 제대로 되어 있는지 검사
// ***********************************************************************************************************
function checkEmail(strText) {
	try {
		if (strText.match(/^(([a-zA-Z0-9_-]+\.)*[a-zA-Z0-9_-]+@([a-zA-Z0-9_-]+\.)+[a-zA-Z0-9_-]+)$/)) {
			return true;
		} else {
			return false;
		}
	}
	catch (ex) {
		alert(ex.description);
	}
}

// ***********************************************************************************************************
// 파일 확장자 검사 true 이면 업로드 불가
// ***********************************************************************************************************
function checkFileExt(strFileName) {
	try {
		if (strFileName.match(/\.(asp|aspx|jsp|php|htm|html|js)$/i)) {
			return true;
		} else {
			return false;
		}
	}
	catch (ex) {
		alert(ex.description);
	}
}

// ***********************************************************************************************************
// 사용자 ID 검사
// ***********************************************************************************************************
function checkUserId(strText) {
	try {
		if (strText.match(/^[a-zA-Z0-9_]{4,12}$/)) {
			return true;
		} else {
			return false;
		}
	}
	catch (ex) {
		alert(ex.description);
	}
}

// ***********************************************************************************************************
// 사용자 비밀번호 검사
// ***********************************************************************************************************
function checkUserPw(strText) {
	try {
		if (strText.match(/^[\S]{4,12}$/)) {
			return true;
		} else {
			return false;
		}
	}
	catch (ex) {
		alert(ex.description);
	}
}

// ***********************************************************************************************************
// 닉네임을 검사
// ***********************************************************************************************************
function checkNickName(strText) {
	try {
		if (strText.match(/^[가-힣a-zA-Z0-9_-]{2,12}$/)) {
			return true;
		} else {
			return false;
		}
	}
	catch (ex) {
		alert(ex.description);
	}
}

// ***********************************************************************************************************
// <br> => \r\n 으로 변경
// ***********************************************************************************************************
function replaceBR(strText) {
	var strReturn = "";

	try {
		strReturn = strText.replace(/<br>/gi, "\r\n");
	}
	catch (ex) {
		alert(ex.description);
	}

	return strReturn;
}
